{
    "AbductionHostageTakingOrHijacking": "Involves taking one or more persons against their will, and may be coupled with threats to harm those persons.", 
    "Accident": "Identifies an Event that happens unexpectedly and unintentionally, and that may result in injury or damage. ", 
    "Accusation": "An Event were some entity is accusing another entity.", 
    "AdequateSupply": "A Factor stating adequatee supplies of things/artifacts (such as a supply of food or fuel) or of services or people in certain roles (such as a supply of trained teachers or firefighters).", 
    "AdministrativeSanctions": "An administrative sanction is any type of formal decree, law or policy aimed at curbing the rights of civilians.", 
    "Advising": "Advising is any type of suggestion or providing advice.", 
    "Affiliation": "The Event describes an occurrence of note such as a new CEO taking over a company, an Organization supporting/affiliating itself with a humanitarian effort, or a pledge of allegiance of a Group to an individual. ", 
    "AggregateEvent": "CollectionOfEventsOrFactors is used to indicate that events are grouped together by a Collection individual.", 
    "Aggression": "This event describes expressions of anger or dominance.", 
    "AgreementOrPromise": "AgreementOrPromise characterizes any act where two or more Actors share the same opinion and/or concur to do something.", 
    "AgriculturalEvent": "AgriculturalEvents deal with any acts such as farming, harvesting, breeding animals, etc.", 
    "AlertStatus": "AlertStatus is defined by/for a GeopoliticalEntity (such as a country, city or organization) or for a specific location. An example would be the U.S. Homeland Security Advisory System", 
    "AmassingAndStockpiling": "Deals with accumulating goods or materials in order to control a market, have surplus in case of emergency, prepare for some future action, etc. ", 
    "Ambush": "An Ambush is a kind of surprise Attack where the adversary conceals themselves and waits to attack.", 
    "Amusement": "Amusement is where an Actor is entertained or finds a situation funny.", 
    "Anger": "Anger is where an Actor is strongly annoyed or hostile toward another or regarding a situation.", 
    "AnimalIllnessOrDeath": "Disease, sickness or death of domestic or wild animals. ", 
    "Announcement": "Deals with any public statements about future events (such as announcing a new CEO of a company or a government's change in policy).", 
    "Annoyance": "Annoyance is where an Actor is bothered or irritated by someone or by a situation.", 
    "Anti-Government": "An additional classification an Event/Factor to indicate that it was targeted against/opposed to the government or current administration.", 
    "Apology": "An expression of regret regarding some trouble/problem that an Actor caused.", 
    "ApplicationOfMilitaryOrPoliticalPressure": "An instance of intimidation or coercion where the Actors (doing the intimidation) are a government and its military.", 
    "AppointmentOrNomination": "AppointmentOrNomination proposes a group or individual for some position, award, etc.", 
    "ApprehensionAnxietyOrWorry": "ApprehensionAnxietyFearOrWorry is where an Actor is troubled by, has misgivings about, or anticipates pain or danger due to a situation or another Actor or thing.", 
    "ArmedConflict": "Conflict between international states, between governmental and non-governmental armed groups, or between non-governmental armed groups only.", 
    "ArrestOrDetention": "ArrestOrDetention is a legal/military ('official') action and should be of some (relatively) limited time and not a sustained jail term.", 
    "Arrival": "The act of getting to a destination. The latter is identified using the general:has_destination property.", 
    "Assassination": "A murder of a public figure by a sudden attack.", 
    "Attack": "An offensive act intended to harm an Actor or damage a location, or an emotional assault against an Actor.", 
    "Attempt": "An additional classification on an Event to indicate that an Actor tried to cause the Event to occur, but did not succeed.", 
    "Autocracy": "A type of governement ... an autocracy is a rule by one person. That person has all the power and makes all the decisions.", 
    "BanOrProhibition": "BanOrProhibition forbids or commands against something.", 
    "Bankruptcy": "Bankruptcy is a legal event where an Actor is declared insolvent and unable to pay their debts.", 
    "Battle": "A fight or combat between opposing forces/groups/persons.", 
    "Belief": "When an Actor has confidence or believes in the ability/capabilities of someone or something.", 
    "BiologicalHazard": "A BiologicalHazard is when an organism, or substance derived from an organism, poses a threat to human or animal health.", 
    "Birth": "Birth defines a specific life event, relative to either the mother, the baby or both.", 
    "BlockadeOrRestrictionOfMovement": "BlockadeOrRestrictionOfMovement is related to activities/events to prevent access, or the flow of goods and people, to/from an area.", 
    "Bombing": "Bombing is an Attack with an explosive weapon.", 
    "BoycottEmbargoSanctionsOrStrike": "Deals with either the withdrawal or cessation of trade or relations with another entity, a refusal to work by a group, or the restriction of movement (i.e., a sanction) of items or people.", 
    "BoycottOrEmbargo": "Deals with the withdrawal or cessation of trade or relations with another entity.", 
    "BusinessCeremony": "Examples of BusinessCeremony include a business opening or party celebrating a company's successful release of a product.", 
    "CargoTransportation": "CargoTransportation describes moving goods by air, ground or naval vessels/vehicles.", 
    "CeasefireOrTruce": "An agreement between Actors to stop fighting/a conflict.", 
    "Ceremony": "A business, social, personal or military gathering in remembrance of a previous event (e.g., a birthday, anniversary, historical event, etc.) or to celebrate/highlight an occassion (such as the opening of a facility).", 
    "Change": "Change is when there is a difference in the availability/amount of a thing/artifact (such as a change in the amount of food, water or schooling), a change in the number of people in certain roles (such as a change in the number of police or teachers), or changes related to 'general' Events (such as a change in the number of murder occurrences in a specific location).", 
    "ChangeOfResidence": "ChangeOfResidence is when an individual or group is moving their home(s) to a new location.", 
    "ChemicalHazard": "A ChemicalHazard is any chemical manufactured, used, transported, or stored that can cause death or other harm through toxic properties of those materials, including chemical agents and chemical weapons.", 
    "CivilCampaign": "Examples of CiviCampaigns are neighborhood watches, or a group of citizens getting together to cleanup a neighborhood or to raise money for a family in need. An Operation occurs over time, has specific goals.", 
    "ClaimingOfResponsibility": "An Actor indicates that they are responsible for some Event.", 
    "ColdTemperature": "Temperatures perceived as 'low', typically related to freezing temperatures, snow/ice, etc.", 
    "CollapsedStructure": "StructuralDamage may be so severe that the structure actually fails/gives way and is no longer usable. Examples of collapsed structures include buildings, bridges, etc.", 
    "CollectingOrRallying": "Any activity involved with generating opposition for something, someone or some (likely, 'Future') Event.", 
    "Collision": "An Accident where a moving object impacts an Actor or Artifact.", 
    "Commanding": "Commanding involves issuing orders or instructions. When classifying individuals with this type, it is important to indicate who/what is commanded. This is accomplished using the event:has_affected_actor and event:has_topic object properties.", 
    "Commemoration": "A Commemoration is a Ceremony held to remember an Event.", 
    "CommercialOperation": "A CommercialOperation is about specific sets of activities that a business undertakes, such as a reorganization, a construction project, a software project, etc. An Operation occurs over time, has specific goals.", 
    "CommissiveCommunication": "Deals with any kind of commitment (in general), agreement, promise, contract, oath taking, etc. and/or expression of intent to do something.", 
    "Communication": "An Event in which information is transferred between Actors or transmitted/published by an Actor.", 
    "CommunicationConveyingEmotion": "Deals with communications conveying empathy (such as apologizing or forgiving), optimism, pessimism, sympathy, thanks, threats, etc.", 
    "CommunicationConveyingEmpathy": "Deals with any communications that express that one Actor understands or shares the feelings of another.", 
    "CommunicationConveyingOptimism": "Deals with any communications that express hope for the future,  or belief in the success of some endeavor/action.", 
    "CommunicationConveyingPessimism": "Deals with any communications that express dismay for the future,  or the belief that some endeavor/action will not succeed/will fail.", 
    "CommunicationViaConferencing": "Indicates that an Actorused the medium of video/chat conferencing to contact another Actor or group.", 
    "CommunicationViaInstantOrTextMessage": "Indicates that an Actor (the active actor) used the medium of text/instant messaging to contact another Actor or group.", 
    "CommunicationViaLetterOrPersonalMail": "Indicates that an Actor (the active actor) used the medium of a message delivered by mail/a postal service or via email to contact another Actor or group.", 
    "CommunicationViaPhone": "Indicates that an Actor (the active actor) used the medium of a cellular phone or land line to contact another Actor or group.", 
    "Compassion": "Compassion is where an Actor is sympathically aware of or concerned about another Actor or a situation.", 
    "Competition": "A Competition may be a sporting event between opposing teams (in which case it is also classified as an event:EntertainmentEvent) or it may describe a general Factor where two or more groups are attempting to establish superiority or control over each other, over a territory, etc. The latter should also be classified as a type of event:Factor. There are many examples of military, political and economic Competition which are defined by the Actors involved in it.", 
    "Complaint": "Deals with any communications that express dismay for the future, or the belief that some endeavor/action will not succeed/will fail.", 
    "ConcentrationOfDisplacedPersons": "A Factor providing data about displacements in/of a population or particular sub-groups within it.", 
    "Concern": "ApprehensionAnxietyFearOrWorry is where an Actor is troubled by, has misgivings about, or anticipates pain or danger due to a situation or another Actor or thing.", 
    "Confession": "Deals with an Actor (the active actor) indicating that they are responsible for some Event.", 
    "Confirmation": "An example of a process associated with the collection and production of intelligence that confirms that an intelligence collection or production requirement is sufficiently important to justify the dedication of intelligence resources.", 
    "Confiscation": "Confiscation deals with taking an Actor's goods or property, based on some authority.", 
    "ConfiscationDamageOrDestruction": "Deals with either taking/seizure of, or the complete or partial loss of an Actor's goods or property.", 
    "Conflict": "No CauseEx event type associated with Conflict", 
    "Congratulation": "Congratulation is an acknoledgement from one Actor to another, that the latter has cause for celebration and/or that the former is pleased with the success of the latter.", 
    "ConsiderationOrExploration": "ConsiderationOrExploration is an act of considering, exploring, studying, ... some idea or proposal, or set of ideas/proposals.", 
    "Consumption": "Consumption deals with expending specific artifacts (food, water, drugs, transportation, etc.).", 
    "ContaminatedWater": "ContaminatedWater is when there is either unsafe for drinking or unusable for farming.", 
    "Contempt": "ContemptOrDisgust is where an Actor is disrespectful toward, scorns, or is repulsed by another Actor, thing or situation.", 
    "Contentment": "Contentment is where an Actor is (happy and) satisfied with their current situation.", 
    "ContractRelatedEvent": "Such as entering into or dissolving a legal contract", 
    "Cooperation": "Cooperation may describe either a specific event where two actors work together to achieve a goal, or a general environment of cooperation.", 
    "CostOfActionOrGoods": "An EconomicFactor describing the costs of goods or services and/or changes in these costs.", 
    "CounterOperation": "A CounterOperation is a coordinated set of activities undertaken in response to another Actor's operation or to a threat. An Operation occurs over time and has specific goals.", 
    "CounterTerrorismOperation": "A coordinated set of activities undertaken in response to a terrorist threat. An Operation occurs over time and has specific goals.", 
    "CriminalAct": "CriminalAct describes any act (or failure to perform an act) of evil or one which is punishable by law.", 
    "CriminalActOrCorruption": "CriminalActOrCorruption describes any act (or failure to perform an act) of evil (which may or may not be punishable by law) or of dishonesty. Note that failure to perform an act is denoted using event:has_polarity and setting its value to event:Negative.", 
    "CropFailure": "An EnvironmentalFactor related to insufficient crops to sustain persons/groups/a community or to provide a surplus to sell in order to acquire other necessities.", 
    "Curfew": "A Curfew is a regulation restricting the movement of people/requiring people to remain indoors between certain hours.", 
    "CyberAttack": "CyberAttack is defined as actions taken in cyberspace that create noticeable denial effects (i.e., degradation, disruption, or destruction) in cyberspace or manipulation that leads to denial that appears in a physical domain.", 
    "CyberDefense": "CyberDefense is defined as actions taken within protected cyberspace to defeat specific threats that have breached or are threatening to breach cyberspace security measures and include actions to detect, characterize, counter, and mitigate threats, including malware or the unauthorized activities of users, and to restore the system to a secure configuration.", 
    "DamageOrDestruction": "DamageOrDestruction is used to identify events that result in complete or partial loss in value of goods or property.", 
    "Death": "Death defines a specific life event when someone dies.", 
    "Debt": "An EconomicFactor providing data on the debts incurred/carried by a GPE, for a population or in a region.", 
    "DeceptiveCommunication": "An intentional action intended to deceive, cause harm or otherwise misrepresent something.", 
    "DecisionOrRecommendation": "DecisionOrRecommendation is an act of concluding or resolving some issue or question.", 
    "DeclarativeCommunication": "Deals with any type of 'declaration' such as accusations, claims/denials of responsibility, defending or supporting/disapproving or denouncing someone or something, vetoes, appraisals, reports, etc. ", 
    "DeclineToComment": "A refusal to reply to a question typically asked by a journalist.", 
    "Decrease": "Decrease, is used to record a decline/decrease in the availability/amount of a thing/artifact (such as a decrease in the amount of food, water or schooling), a decline/decrease in the number of people in certain roles (such as a decrease in the number of police or teachers), or decreases related to 'general' Events.", 
    "Deescalation": "Deescalation is a reduction in the intensity of a disagreement or conflict.", 
    "DefenseOrSupport": "DefenseOrSupport deals strictly with arguing in defense/support of a topic or Actor.", 
    "DefensiveManeuver": "Any MilitaryAction taken to defend against or to deter aggression or attack.", 
    "DefyingLawsNormsDirectives": "DefyingLawsNormsDirectives represents a range of activities (some of which may also be classified as CriminalActs).  The event is about defiance more than criminality.", 
    "Demand": "Demands are forcful requests.", 
    "Demobilization": "The process of transitioning a conflict or wartime military establishment and defense-based civilian economy to a peacetime configuration while maintaining national security and economic vitality.", 
    "Democracy": "Democracy is a form of government where decision-making is by vote of the people, where the people vote directly on issues and/or vote for officials who make decisions on their behalf.", 
    "DemonstrationOrProtest": "A public gathering that is in support of or against some topic, thing or Actor.", 
    "Denial": "Deals with an Actor (the active actor) indicating that some Event or the existence of some Artifact is not true.", 
    "DenialOfResponsibility": "Deals with an Actor (the active actor) indicating that they are NOT responsible for some Event.", 
    "Departure": "The act of leaving a destination.", 
    "Dependance": "Describes a condition where there is a reliance/need/requirement between two entities.", 
    "Deportation": "The act of expelling a person from a country.", 
    "Desperation": "Desperation is where an Actor has lost hope and may act recklessly.", 
    "Deterrence": "The prevention of action by the existence of a credible threat of unacceptable counteraction and/or belief that the cost of action outweighs the perceived benefits.", 
    "DiplomaticCooperation": "DiplomaticCooperation may describe either a specific event where two actors work together to achieve a goal, or a general environment of diplomatic cooperation.", 
    "DiplomaticRecognition": "DiplomaticRecognition is the acknowledgment of a country/GPE by another, or the acknowledgment/rejection of the actions of a country (such as the occupation of a territory outside of its boundaries).", 
    "DiplomaticSanctions": "Diplomatic sanctions are the reduction or removal of diplomatic ties, such as by the closing of embassies or the recall of a diplomat.", 
    "DirectiveCommunication": "Deals with advising, commanding, permitting/prohibiting or warning someone and/or about how to perform an action or reach a goal.", 
    "DisagreementOrDispute": "DisagreementOrDispute characterizes any act where two or more Actors do NOT share the same opinion or thoughts.", 
    "DisapprovalOrDenunciation": "Examples of DisapprovalOrDenunciation include denouncing a Person who might be accused of a crime or of a certain ethnicity, denouncing an action/event that an Actor performed, or denouncing a thing, such as denouncing guns/firearms.", 
    "Disgust": "An EmotionalResponse where an Actor is disrespectful toward, scorns, or is repulsed by another Actor, thing or situation.", 
    "DisinformationCampaign": "A DisinformationOperation involves the release of false information with the intent of misleading or deceiving some Actors.", 
    "Distrust": "DistrustOrSuspicion is where an Actor has misgivings about someone or something.", 
    "Donation": "A Donation is a gift of goods, monies, services, etc. to some Actor.", 
    "Drought": "A Drought is a (significant) period of time without rainfall, leading to a water shortage.", 
    "EarthquakeAndAftershock": "A NaturalDisaster related to the movement of the earth's crust or due to volcanic activity.", 
    "EconomicCondition": "Characterizations of the economy of a population or in a region.", 
    "EconomicCooperation": "EconomicCooperation may describe either a specific event where two actors work together to achieve a goal, or a general environment of economic cooperation.", 
    "EconomicCrisis": "This event is an example of economic recession/depression or hyperinflation/deflation.", 
    "EconomicDepression": "An EconomicCondition describing that the economy for a population or in a region is contracting/in a depression.", 
    "EconomicDevelopment": "Any specific Events or EconomicFactors related to improving the economic and social environment of a population or in a region.", 
    "EconomicEquality": "EconomicCondition describing equal distributions of incomes and opportunities in an area or for a population.", 
    "EconomicFactor": "Deals with any aspect of the economic environment.", 
    "EconomicInequality": "EconomicCondition describing unequal distributions of incomes and opportunities in an area or for a population.", 
    "EconomicInflation": "In economics, inflation is related to a general increase in prices (usually due to a decrease in the purchasing power of a country's currency.", 
    "EconomicOpportunity": "EconomicOpportunity may describe either a specific event where an Actor gains some advantage from selling/buying/leasing/... something, or a general environment of economic advantage.", 
    "EconomicRecession": "An EconomicCondition describing that the economy for a population or in a region is contracting/in a recession.", 
    "EconomicSanctions": "Economic sanctions are typically expressed as a ban on trade between countries, which may be limited to certain goods or apply to all goods (with certain exceptions).", 
    "EconomicSecrecy": "EconomicSecrecy is obfuscation, and lack of accountability and openness regarding economic activities and conditions.", 
    "EconomicTension": "An economic dispute between two geopolitical entities.", 
    "EconomicTransparency": "EconomicTransparency is clarity, lack of obfuscation, accountability and openness regarding economic activities and conditions.", 
    "Election": "Election is the process of choosing someone for a position (which may be a political office, but is not necessarily so - e.g., 'John was elected to be the jury foreman'). This is distinct from Voting, which is meant to address both voting for/against a candidate or on an issue.", 
    "ElectionCampaign": "An organized effort by a candidate to influence the outcome of an Election. An Operation occurs over time and has specific goals.", 
    "ElectromagneticRadiationHazard": "A kind of EnvironmentalHazard where a transmitter or antenna installation generates or increases electromagnetic radiation in excess of established safe levels.", 
    "EmotionalResponse": "A Person's or GroupOfPerson's positive or negative reaction to an Event or situation.", 
    "EmploymentRelatedEvent": "Employment generally describes specific events (such as the hiring of a new CXX officer or the hiring or lay off of personnel), a general condition/factor describing the increase/decrease of employment for a population or in a region, or statistics related to employment numbers.", 
    "EntertainmentEvent": "Examples of EntertainmentEvent are a sporting events/competitions, performances, etc.", 
    "EnvironmentalDegradation": "EnvironmentalFactors address geography and man-made structures as well as the climate, weather and conditions in an area.", 
    "EnvironmentalHazard": "EnvironmentalHazards are substances or conditions with the potential to cause injury, illness, or death of personnel; damage to or loss of equipment or property; or mission degradation.", 
    "Escape": "Events dealing with an entity getting free, who has been physically captured/detained.", 
    "EspionageOperation": "An Operation occurs over time, has specific goals, and is composed of specific, coordinated acts/Events intended to achieve those goals.", 
    "EspionageOrTreason": "EspionageOrTreason addresses both the act of spying/illicitly obtaining information and formal acts of treason against one's country.", 
    "EthnicCleansing": "Ethnic cleansing is a purposeful policy designed by one ethnic or religious group to remove by violent and terror-inspiring means the civilian population of another ethnic or religious group from certain geographic areas.", 
    "Evacuation": "The clearance of personnel, animals, or materiel from a given locality.", 
    "EvaluationOrAppraisal": "Examples of EvaluationOrAppraisal include evaluating a Person in a position, evaluating the performance of the active actor in an action/event, or evaluating a thing, such as appraising a building/facility.", 
    "Event": "An occurrence or happening in a (real or virtual) location at some time or over some interval.", 
    "Excess": "There can be excesses of things/artifacts (such as an excess of food or fuel), excesses of services or people in certain roles (such as an excess of teachers or homeless), or excesses related to different Factors (such as an excess of violence).", 
    "Execution": "Carrying out a death sentence against a person. A 'death sentence' is a form of legal sentencing/penalty.", 
    "ExhibitionOfPower": "An ExhibitionOfPower is any act that demonstrates the authority and/or capabilities of a group, but that does not include the use of force.", 
    "ExpansionOrDevelopment": "ExpansionOrDevelopment is concerned with activites/new developments designed to increase (something) in size/quantity/quality/volume/scope/etc.", 
    "ExploitationOfNaturalResources": "The ExploitationOfNaturalResources class deals with any acts that involve obtaining, processing or using the materials in the natural environment. This includes drilling, mining, harvesting forests, irrigation projects, refining fuels, etc.", 
    "ExploratoryCommunication": "Deals with communicating to better understand someone or something (for example via an interview), questioning or investigating (including investigating alternatives such as in a negotiation).", 
    "ExplosiveHazard": "An EnvironmentalHazard that is any material posing a potential threat that contains an explosive component such as unexploded explosive ordnance, booby traps, improvised explosive devices, captured enemy ammunition, and bulk explosives.", 
    "Export": "Export deals with any conditions favorable/disfavorable to sending goods or services to another country, or various statistics related to exports. Factors which influence export include their availability, trade policies, exchange rates and demand, among others.", 
    "ExportImport": "ImportAndExport deals with any conditions favorable/disfavorable to bringing goods or services into/out of a country, or various statistics related to import/export. Factors which influence import/export include their availability, trade policies, exchange rates and demand, among others.", 
    "ExpressionOfCondolenceOrSympathy": "ExpressionOfCondolenceOrSympathy is empathy with another's grief.", 
    "ExpressionOfIntent": "ExpressionOfIntent is a type of communication indicating how an Actor plans to do/accomplish something.", 
    "Expulsion": "Expulsion deals with forcing an individual to leave a place or organization.", 
    "ExpulsionDeportationOrWithdrawal": "Withdrawal is a movement out/retraction of a previously held position or ceasing to participate in an activity.", 
    "ExtraJudicialExecution": "The 'killing of a person [or persons] by governmental authorities or individuals without the sanction of any judicial proceeding or legal process.", 
    "Extradition": "Extradition is 'an act where one jurisdiction delivers a person accused or convicted of committing a crime in another jurisdiction, over to their law enforcement. It is a cooperative law enforcement process between the two jurisdictions and depends on the arrangements made between them.'", 
    "Factor": "An identifiable element in the physical, economic, social, technological, ... environment that contributes to/influences an Event. A Factor is typically a state, condition or details/statistics describing the environment. It may or may not have a specific location, time, or actor(s) associated with it.", 
    "Famine": "Famine is the condition characterized by a severe shortage of food that results in starvation and death.", 
    "Fear": "ApprehensionAnxietyFearOrWorry is where an Actor is troubled by, has misgivings about, or anticipates pain or danger due to a situation or another Actor or thing.", 
    "FeelingSafeOrSecure": "FeelingSafeOrSecure is where an Actor believes that they are free from danger, harm or risk.", 
    "FilingOfLawsuit": "Deals with registering a legal document which claims loss(es) due to the actions (or lack of action) by another, and remedies to be imposed by a court/the judicial system.", 
    "FinancialDeposit": "Concerns actions/events related to putting money into a bank or similar institution, a partial payment made at the time of purchase of something, a payment that acts as security and is made at the time of acquiring/taking something for temporary use, or any payment indicating that an obligation will be met.", 
    "FinancialEvent": "FinancialEvents involve monies/currency, such as a transfer of funds.", 
    "FinancialWithdrawal": "Concerns actions/events related to removing money or other securities/capital.", 
    "FindingOfGuilty": "FindingOfIGuilty covers any legal judgment/verdict where the defendant is found 'guilty'. A synonymous term is 'convicted'.", 
    "FindingOfInnocent": "FindingOfNotGuilty covers any legal judgment where the defendant is found 'not guilty'. A synonymous term is 'acquittal'.", 
    "Fire": "A Fire can be a specific Event (such as a house fire) or an environmental concern/factor (such as a wildfire). The latter is indicated by using the sub-class, event:WildFire.", 
    "Flood": "Floods involve a body of water overflowing onto normally dry lands. It may be the result of heavy rains or due to another reasons (such as the failure of a dam).", 
    "FoodInsecurity": "Food insecurity indicates a state/condition where people do not have access to 'sufficient, safe and nutritious food to meet their dietary needs and food preferences'.", 
    "FoodSecurity": "Factor describing Food security which is defined as 'when people, at all times, have physical and economic access to sufficient, safe and nutritious food to meet their dietary needs and food preferences for an active and healthy life'.", 
    "ForcedMove": "A ForcedMove is an involuntary change of location which could be for humanitarian, political or military reasons. Various sub-classes of ForcedMove are defined such as Expulsion, Extradition and Evacuation.", 
    "Forgiving": "Forgiving is a type of Communication where one Actor accepts the apology of another, or decides to stop being upset or resentful toward another.", 
    "FormalAgreement": "A FormalAgreement is a documented agreement/commitment between governments or legal entities/Actors.", 
    "FreedomOfAccess": "An event discussing the ability to move people or goods across international passages on land/water/air.", 
    "Frustration": "Frustration is where an Actor has negative feelings due to being unable to change or achieve a situation.", 
    "Funeral": "A Funeral is a type of Ceremony to honor a Person after their death. It may involve visitation and a formal ceremony and may include burial/cremation.", 
    "GeopoliticalTension": "General geopolitical tension between two geopolitical entities.", 
    "Goodwill": "Goodwill is where an Actor has a friendly, helpful or cooperative attitude (in general or toward another).", 
    "GoverningDirective": "GoverningDirective is any law, policy or other formal declaration/instruction which is issued by a governmental authority/GPE and defines/restricts actions and behavior for a populace or a region.", 
    "GovernmentCeremony": "An example of a GovernmentCeremony is an inauguration of a newly elected official.", 
    "Graduation": "Graduation is a Ceremony in which a person or person(s) are given diplomas and/or granted academic degrees. A synonym is 'commencement'.", 
    "GrantingOfAsylum": "GrantingOfAsylum indicates that a GPE allows a foreign citizen to remain on its territory, at its embassies, on its vessels, etc. because they cannot return to their home country. This may be because of persecution or a fear of persecution due to ethnicity, religion, nationality, affiliations, etc.", 
    "Grief": "Grief is where an Actor has feelings of intense sorrow due to the loss of someone or something.", 
    "GuardingOrPatrolling": "GuardingOrPatrolling is the act of watching over someone or something in order to protect them or prevent harm. The action could involve a 'patrol' which periodically navigates around/through an area for security purposes.", 
    "Happiness": "Happiness is a range of EmotionalResponses from contentment to intense joy.", 
    "Hatred": "Hatred is where an Actor experiences intense dislike for another Actor, thing or situation.", 
    "HeadquartersOrBaseEstablished": "HeadquartersOrBaseEstablished describes an occurrence of note involving the opening/establishment of an office that serves as the administrative center of an enterprise, or the opening/establishment of a military installation from which operations are initiated or commanded.", 
    "HealthAndDisease": "HealthAndDisease generally describes specific events, general conditions such as disease outbreak in a region or malnutrition in a population/region, increase/decrease trends or statistics  related to health and disease.", 
    "Heritage": "A Factor providing data about the ethnic characteristics of/ethnicities observed in a population or its sub-groups.", 
    "HighTemperature": "Temperatures perceived as 'high', typically nearing or above human body temperatures.", 
    "HighUnemployment": "An EconomicCondition describing that many people in a region or segment of the population are without work/are unemployed.", 
    "HighWind": "A WeatherIssue describing strong gusts of air. Synonyms include the terms, 'squall', 'breeze', 'gale'. High winds may damage property, affect the spread of fire or enable the dispersal of plant seeds.", 
    "Hope": "Hope is where an Actor has positive feelings, desires or expectations that something will occur.", 
    "HumanRightsAbuse": "HumanRightsAbuses address a range of events from unfair trials and restriction of freedoms of expression, all the way to torture, murder, etc.", 
    "HumanitarianCrisis": "A Factor that threatens the health, safety or well being of an area and its populace. It can be a natural or man-made disaster or a complex emergency.", 
    "HungerStrike": "A voluntary refusal to eat, over a prolonged period of time, intended as an act of protest.", 
    "Hurricane": "HurricaneOrTyphoon describes a type of TropicalStorm with sustained winds of 74mph or higher. Hurricanes occur in the Atlantic Ocean and northeastern and north central Pacific Ocean. and a typhoon occurs in the Indian and northwestern Pacific Ocean.", 
    "Identification": "Identification involves asserting who or what someone or something is (for example, identifying an assailant or murder weapon), or who/what/how a situation came to be.", 
    "Illness": "Used when a person or population/group is sick due to a contagion, mental condition or disease. The semantics can describe a specific event, a general condition/factor of increased/decreased illness by a set of people or in a region, or statistics related to illness in a population/region.", 
    "IllnessOrWounding": "When a person is ill or injured in some way, but the exact nature of the condition is unknown, then this class should be used. However, if the condition is known to be a disease, mental condition or sickness due to a contagion, then the more specific class of Illness should be used. If the condition is due to an injury, then that class (or its event:Wounding sub-class) should be used.", 
    "Import": "Import deals with any conditions favorable/disfavorable to bringing goods or services into a country, or various statistics (an individual meas:ReportedValue or meas:TimeSeries) related to imports. Factors which influence import include their availability, trade policies, exchange rates and demand, among others.", 
    "Incompetency": "Describes that a specific Actor (Person, GroupOfPersons/Organization, GeopoliticalEntity, ...) is incompetent or that a situation of incompetency exists in some location/organization/etc. Note that the 'incompentent' Actor is related to the Factor using event:has_actor.", 
    "Increase": "The class, Increase, is used to record a growth/increase in the availability/amount of a thing/artifact (such as an increase in the amount of food, water or schooling), a growth/increase in the number of people in certain roles (such as an increase in the number of police or teachers), or increases related to 'general' Events (such as an increase in the number of MurderOrHomicide occurrences in a specific location) or Factors (such as an increase in the Anger level in a community).", 
    "Indictment": "A formal charge/LegalEvent accusing an Actor of wrongdoing.", 
    "InfectiousHumanDisease": "InfectiousHumanDisease may describe either a specific illness/sickness, the presence of a disease/outbreak in a population/region, overall trends and changes (e.g., Increase/Decrease/Stasis) or statistics.", 
    "InformationCampaign": "Information operations are 'the integrated employment, during military operations, of information-related capabilities in concert with other lines of operation to influence, disrupt, corrupt, or usurp the decision-making of adversaries and potential adversaries.'", 
    "InitiationOrStart": "An additional classification on an Event to indicate that an ongoing Event/Factor began.", 
    "Injury": "Used when a person is harmed in some specific event, to provide statistics, or to describe a general condition/factor of increased/decreased injury (Increase/Decrease/Stasis). Note that Wounding is a sub-class indicating that an injury was the result of some violence.", 
    "InsectInfestation": "The condition of being invaded or overrun by insects that feed on humans, animals, plants, wooden structures, etc. Individuals may describe specific infestation events, the general conditions or overall trends and changes (Increase/Decrease/Stasis) related to infestations, or statistics.", 
    "InspectionOrObservation": "InspectionOrObservation involves both formal and informal review/paying attention to someone or something and (likely) producing a report/analysis.", 
    "Inspiration": "Inspiration is where an Actor is motivated to do something/be creative.", 
    "IntelligenceGathering": "IntelligenceGathering deals with activities to collect, collate, evaluate, analyze, integrate and interprete collected military or economic information.", 
    "IntelligenceOperation": "A long term sustained activity with multiple steps where intelligence gathering occurs.", 
    "InternationalSecurity": "Factor describing the state of international security.", 
    "Interview": "An Interview involves questioning a Person to gather information, especially regarding information to be hired, for the purpose of doing an evaluation, etc.", 
    "IntimidationAndCoercion": "Event dealing with the use of force or authority to compel or dissuade action, or to induce fear.", 
    "Investigation": "Investigation can be either a formal or informal search for someone, something, some place (e.g., a facility) or some information.", 
    "Investment": "Investment may describe specific events (such as a Person investing their lottery winnings in a business), general conditions such as an increase/decrease in investments in a population/region/location, or statistics related to investment.", 
    "Invitation": "An Invitation is a request/communication (either verbal or written) to participate or be present in some event.", 
    "IssuingPublishingOrReleasing": "IssuingPublishingOrReleasing involves activities related to providing something new, potentially in return for payment. Examples include providing visual, audio or written materials (such as issuing a press release), or releasing a new product or software. The goal is to make something known, or to announce, provide or disseminate something to some Actor(s).", 
    "Jealousy": "Jealousy is an EmotionalResponse where an Actor envies another and their situation or possessions.", 
    "JointOperation": "A JointOperation 'connotes activities [and] operations ... in which elements of two or more Military Departments participate'. An Operation occurs over time and has specific goals.", 
    "JudicialCooperation": "JudicialCooperation may describe either a specific event where two actors work together to achieve a goal, or a general environment of cooperation.", 
    "JuryDeliberation": "JuryDeliberation is an activity of a trial's jury, where the members of the jury discuss the trial and legal arguments (in private) to decide on a verdict (guilty or not guilty, or deciding in favor of the case's plaintiff or defendant).", 
    "LackOfRespectForRightsFreedoms": "Fundamental rights include the right to self-determination, liberty, due process and peaceful assembly/freedom of association, as well as freedom of thought, religion, movement and expression. This class deals with restrictions or refusal to permit individual freedoms by the government, military, law enforcement or social groups. It includes passing laws, ignoring abuses, or actively suppressing rights and freedoms. LackOfRespectForRightsFreedoms may describe either a specific event, or a general environment of lack of respect.", 
    "LandslideOrMudslide": "A slide of a large mass of dirt, rock or mud down a mountain or cliff. It is a form of NaturalDisaster.", 
    "Lawlessness": "A Factor dealing with disorder and/or disrespect for the law in a region or for a population. ", 
    "LegalEvent": "Any activity/event based on law, official or accepted rules, or related to or allowed by laws or the legal system.", 
    "LegalFinding": "A legal finding is either 'guilty' or 'not guilty' for a criminal case, or a finding in favor of the plaintiff or defendant in a civil case.", 
    "LegalFine": "A LegalFine is the amount of money or penalty that a court, jury or other authority decides has to be paid as punishment for a crime or other offence.", 
    "LegalProceedingsOrTrial": "A type of LegalEvent, such as a trial or binding arbitration.", 
    "LegalSentence": "A LegalSentence is 'the post-conviction stage of the criminal justice process, in which the defendant is brought before the court for the imposition of a penalty ... A sentence is the penalty ordered by the court. Generally, the primary goals of sentencing are punishment, deterrence, incapacitation, and rehabilitation. In some states, juries may be entitled to pronounce sentence, but in most states, and in federal court, sentencing is performed by a judge.", 
    "Loan": "Something that is lent/borrowed. If money is lent, then a Loan individual would also be a FinancialEvent.", 
    "LocationChange": "LocationChange involves the movement of people or goods.", 
    "Looting": "Stealing/plundering during riots or in wartime.", 
    "LowUnemployment": "An EconomicCondition describing that many people in a region or segment of the population have work/are employed.", 
    "Malnutrition": "Malnutrition may describe either a specific case of malnutrition, or a general conditions/statistics in a region.", 
    "ManufacturingOrBuilding": "ManufacturingCreatingOrBuilding deals with defining, supervising, engaging in or financing the construction of something, creating a plan for something (such as a blueprint), or developing, founding, strengthening or building something up.", 
    "MaritimeSupply": "Ability of a geopolitical entity to get goods shipped into their territory by water.", 
    "Marriage": "The legal binding of two Actors in marriage, which is also usually a social event/ceremony.", 
    "MassKilling": "Mass killing is defined as a multiple homicide incident in which four or more victims are killed, within one event, and in one or more locations in close proximity.", 
    "Mediation": "Mediation is a type of Negotiation to resolve differences or bring about a settlement that is conducted by some impartial party.", 
    "MedicalEmergency": "MedicalEmergency is a specific event, requiring immediate medical attention/assistance, where an individual's life or organ/body function may be lost or severely impaired. The Actor/Person requiring attention is identified as the affected actor.", 
    "MeetingEncounterOrNegotiation": "A formal, informal or coincidental gathering or assembly of people.", 
    "MeetingOrEncounter": "A formal, informal or coincidental gathering or assembly of people.", 
    "Merger": "A Merger is a FormalAgreement and LegalEvent that defines the combination of two or more entities.", 
    "Migration": "Movement to a new location, usually to a country where the Actor is not a citizen, in order to settle there.", 
    "MilitaryAction": "MilitaryAction is a general semantic for any type of military activity or action, etc.", 
    "MilitaryBuildup": "The movement of troops or equipment by a geopolitical entity in preparation of or to guard against conflict.", 
    "MilitaryCampaignOrOperation": "A military operation is 'a sequence of tactical actions with a common purpose or unifying theme.  An Operation occurs over time and has specific goals.", 
    "MilitaryCapability": "Factor describing the a military capability such as a weapon, technlology or force size.", 
    "MilitaryCooperation": "MilitaryCooperation may describe either a specific event where two actors work together to achieve a goal, or a general environment of cooperation.", 
    "MilitaryDeescalation": "MilitaryDeescalation is a reduction in the intensity of a military conflict.", 
    "MilitaryDeployment": "MilitaryDeployment is the deployment of military troops and/or weapons by a geopolitical entity.", 
    "MilitaryExercise": "A MilitaryExercise is 'a military maneuver or simulated wartime operation involving planning, preparation, and execution that is carried out for the purpose of training and evaluation'.", 
    "MilitaryTension": "Tension between two geopolitical entities that could result in armed conflict.", 
    "MissingPersons": "MissingPersons are individuals who have disappeared and whose fate/condition are not known.", 
    "Mobilization": "Mobilization is the process of assembling and organizing national resources to support national objectives in time of war or other emergencies.", 
    "MurderOrHomicide": "MurderOrHomicide deals with the premeditated or unintentional killing of an individual by another.", 
    "NeedOrRequirement": "Describes a condition where there is a reliance/need/requirement between two entities.", 
    "Negotiation": "Negotiation is an ExploratoryCommunication intended to produce an agreement, resolve differences or bring about a settlement between several Actors.", 
    "NuclearHazard": "An EnvironmentalHazard concerning dangers associated with the blast, thermal, and radiation effects from nuclear explosion.", 
    "OathTaking": "An oath is a form of promise regarding future actions or behavior. A synonym is to 'swear'. A statement or text including the words, 'with God as my witness' or 'so help me God' (where 'God' is something sacred to the individual taking the oath), is usually considered an oath.", 
    "OccupationOfTerritory": "OccupationOfTerritory or 'occupied territory' describes that a region is under the authority and control of another GeopoliticalEntity and (typically, with the support of) their armed (military or para-military) force.",
    "Operation": "An Operation occurs over time, has specific goals, and is composed of specific, coordinated acts/Events intended to achieve those goals.", 
    "Ownership": "Conveys the semantic of possessing or having the right to possess some goods or property. Although ownership sometimes implies possession, that is not guaranteed. Problems often occur when ownership is disputed, or the Actor possessing an entity is not the same as the Actor that owns it.", 
    "Paranoia": "An unreasonable fear or apphrension held by an Actor.", 
    "Pardon": "A Pardon is the act of formally excusing/forgiving a mistake or offense.", 
    "Parole": "A Parole is a release from prison that entitles the individual to live outside the prison as long as they comply with the terms of the release.", 
    "PaymentOrRepayment": "PaymentOrRepayment is an act of reimbursing an Actor for a services, goods or monies.", 
    "Peacekeeping": "Peacekeeping events are  military operations undertaken, with the consent of all major parties to a dispute, designed to monitor and facilitate implementation of an agreement (ceasefire, truce, or other such agreement) and support diplomatic efforts to reach a long-term political settlement.",
    "PeacekeepingOperation": "A PeacekeepingOperation is a coordinated set of activities undertaken to maintain peace in a region. An Operation occurs over time and has specific goals.", 
    "Performance": "An EntertainmentEvent related to setting up for and presenting a live musical, acting, dance or vocal show/concert/enactment/...", 
    "Permission": "Permission is a kind of Communication giving approval to do something.", 
    "PersonalCommunication": "PersonalCommunication deals with the means that an Actor uses to communicate with others. It is a catchall for communicating via conferencing technology (such as Skype), via written materials (such as a letter, email or instant message), or via phone.", 
    "PersonalLifeEvent": "Examples of PersonalLifeEvents include birth, marriage, graduation and death.", 
    "PersonalTransportation": "PersonalOrPassengerTransportation describes moving people by air, ground or naval vessels/vehicles.", 
    "PhysicalAssault": "An offensive act intended to physically harm an Actor or damage a location.", 
    "PhysicalSecurity": "PhysicalSecurity is concerned with physical measures designed to safeguard personnel; to prevent unauthorized access to equipment, installations, material, and documents; and to safeguard them against espionage, sabotage, damage, and theft.", 
    "Pilgrimage": "A journey/travel to a special or sacred place.", 
    "PlacementAsHumanShield": "PlacementAsHumanShield describes 'the deliberate placement of non-combatants in or around combat targets to deter the enemy from attacking these combat targets. It may also refer to the use of persons to literally shield combatants during attacks, by forcing them to march in front of the combatants.'", 
    "Planning": "Planning describes any acts of defining a program or course of action, laying out of how a program/project will proceed, or what to do if/when an Event occurs.", 
    "PolicyChange": "A reversal or change in attitude, principle or point of view.", 
    "PoliticalCorruption": "Factor representing corrupt activity performed by political officials inside of a government.", 
    "PoliticalDissent": "PoliticalDissent can be a specific Event (such as a protest indicating dissent) or a general state of affairs.", 
    "PoliticalInstability": "PoliticalInstability is a Factor describing overall conditions in a region/GeopoliticalEntity. It 'can be defined in at least three ways. A first approach is to define it as the propensity for regime or government change. A second is to focus on the incidence of political upheaval or violence in a society, such as assassinations, demonstrations, and so forth. A third approach focuses on instability in policies rather than instability in regimes", 
    "PoliticalReform": "PoliticalReform can be a specific Event (such as a specific change of a law) or a general environment fostering reform.", 
    "PoliticalRevolution": "A PoliticalRevolution is the overthrow of a government. It describes the specific events of an overthrow or the general environment where a revolution is imminent or has recently occurred (with its associated period of transition).", 
    "PoliticalSecrecy": "PoliticalSecrecy is obfuscation, and lack of accountability and openness regarding governmental and political activities and conditions.", 
    "PoliticalTension": "Political tension between two entities either within the government of a geopolitical entity or between geopolitical entites.", 
    "PoliticalTransparency": "PoliticalTransparency is clarity, lack of obfuscation, accountability and openness regarding governmental and political activities and conditions.", 
    "Pollution": "Pollution addresses both the act of contaminating the environment and the condition of the environment being contaminated by harmful substances.", 
    "Possession": "Conveys the semantic of possessing some goods or property. Although ownership sometimes implies possession, that is not guaranteed. Problems often occur when the Actor possessing an entity is not the same as the Actor that owns it.", 
    "Poverty": "An EconomicCondition describing that a region or population has little or no money and few or no possessions.", 
    "PraisingOrEndorsing": "PraisingOrEndorsing deals with any expressions of approval or commendation.", 
    "PriceGouging": "PriceGouging is either a specific act of inflating prices or the general condition of inflated prices for commodities and basic necessities, such as could occur due to a shortage after a natural disaster.", 
    "Pricing": "An EconomicFactor describing the costs of goods or services and/or changes in these costs.", 
    "Pride": "Pride is where an Actor feels self-worth and value (in general) or feels satisfaction with an accomplishment or regarding some situation.", 
    "Pro-Government": "An Event/Factor that was in support of the government or current administration.", 
    "PromotionOfWaterSanitationAndHygiene": "Describes a campaign to educate people, helping them to understand and develop the value of water sanitation and good hygience practices. The goal is to prevent disease and death.", 
    "ProvisionOfAid": "ProvisionOfAid is any type of transfer of resources between Actors (typically, GeopoliticalEntities or Organizations). The resouce(s) that are transferred can be monetary (loans, grants or contributions), goods, skills or personnel (such as providing health-care or military skills), training, etc.", 
    "ProvisionOfEconomicAid": "ProvisionOfEconomicAid is any type of transfer of economic-related resources between Actors (typically, GeopoliticalEntities or Organizations). The resouce(s) that are transferred can be moneties (loans, grants or contributions), goods, skills or personnel, training, etc.", 
    "ProvisionOfHumanitarianAid": "ProvisionOfHumanitarinAid is any type of transfer of resources between Actors (typically, GeopoliticalEntities or Organizations) for humanitarian reasons and to promote the well-being of a populace. The resouce(s) that are transferred can be monetary (loans, grants or contributions), goods, skills or personnel (such as providing health-care or military skills), training, etc.", 
    "ProvisionOfInspectorsOrObservers": "ProvisionOfInspectorsOrObservers describes providing a Person or GroupOfPersons to record and report on the processes, institutions, laws, etc. related to some event.", 
    "ProvisionOfMilitaryAid": "ProvisionOfMilitaryAid is any type of transfer of military-related resources between Actors (typically, GeopoliticalEntities  or Organizations). The resouce(s) that are transferred can be monetary (loans, grants or contributions), goods/armaments/..., skills or personnel, training, etc.", 
    "ProvisionOfMilitaryTrainingSchooling": "A specific type of military aid related to developing and/or improving the ability of military personnel to perform their duties/roles.", 
    "ProvisionOfProtectionOrPeacekeepers": "ProvisionOfProtectionOrPeacekeepers describes providing a Person or GroupOfPersons to maintain peace and security in a region.", 
    "ProvisionOfReligiousTrainingSchooling": "Training in the practices and beliefs of a specific religion.", 
    "ProvisionOfTerroristTrainingSchooling": "Training in skills to carry out terrorist activities.", 
    "ProvisionOfTrainingSchooling": "ProvisionOfTrainingSchooling is any type of transfer of education-related resources between Actors (typically, GeopoliticalEntities or Organizations). The resouce(s) that are transferred can be monetary (loans, grants or contributions), skills or personnel, etc.", 
    "ProvisionOfVocationalTrainingSchooling": "A specific type of training to acquire the skills of a trade (such as being an electrical or auto repair technician, dental/medical assistant, etc.).", 
    "PsychologicalAttack": "A PsychologicalAttack is intended to cause emotional harm/damage.", 
    "Purchasing": "Purchasing describes specific events (such as a paramilitary organization buying ammunitions), general conditions describing increases/decreases in purchasing in a region or for a populace or statistics related to purchases/buying.", 
    "RadiologicalHazard": "An EnvironmentalHazard where there is ionizing radiation that can cause damage, injury, or destruction from either external irradiation or due to radiation from radioactive materials within the body.", 
    "Raid": "Raid characterizes any activities related to surprise attacks on an Actor or Location, search without warning, and/or the taking of goods related to such an attack.", 
    "RainfallAndRunoff": "A WeatherIssue providing data (typically, an individual meas:ReportedValue or meas:TimeSeries) on the amount or surplus/overflow of rain in a GPE or region. The Location is identified using the general:located_at property.", 
    "Receipt": "Receipt is for cases where something is received over the course of time, or when it is necessary to record a concept such as 'receipt of the prisoners'.", 
    "Reconnaissance": "A mission undertaken to obtain, by visual observation or other detection methods, information about the activities and resources of an enemy or adversary, or to secure data concerning the meteorological, hydrographic, or geographic characteristics of a particular area.",
    "ReconnaissanceOperation": "A ReconnaissanceOperation is an of Operation dealing any type of information gathering about an Actor or region. An Operation occurs over time and has specific goals.", 
    "RecoveryOrRescue": "Recovery or rescue of material goods or people.", 
    "ReductionRestrictionOrRemoval": "ReductionRestrictionOrRemoval characterizes any act intended to decrease, reduce, take away, dispose of or discard something or the quantity/quality of some Actor. ", 
    "RefusalOrRejection": "RefusalOrRejection characterizes any act where an Actor does not accept or acknowledge something, some offer or someone.", 
    "ReleaseOfPropaganda": "Activity dealing with the creation, distribution or consumption of propaganda.", 
    "ReleaseOrParole": "ReleaseOrParole is any act of freeing someone or something (from confinement).", 
    "ReligiousCeremonyOrWorship": "Describes a religious event or act of public worship (or a portion of that event) that follows prescribed formats/rules.", 
    "ReligiousOrPoliticalBeliefs": "Indicates the presence of various religious or political beliefs in an area or the beliefs held by a population/group of people.", 
    "ReportAsMissing": "ReportAsMissing is a Communication conveying that someone or something has disappeared and whose fate/condition not known.", 
    "Reporting": "Reporting characterizes any act of informing, describing, accounting for or representing something or someone.", 
    "RepresentativeCommunication": "Deals with any type of 'declaration' such as accusations, claims/denials of responsibility, defending or supporting/disapproving or denouncing someone or something, vetoes, appraisals, reports, etc. (whether what is declared is 'true' or 'false' is not considered).", 
    "Repression": "Repression can be a specific Event (such as repression of a riot) or a general state of affairs.", 
    "RequestAppealOrDemand": "Deals with either a request or a demand, when it is not known which was communicated.", 
    "RequestOrAppeal": "RequestOrAppeal characterizes any Communication that expresses a need or desire for something (including information), someone or that some Event occur.", 
    "RequestOrAppealForAsylum": "RequestOrAppealForAsylum indicates that an Actor has asked (or intends to ask) a GPE to allow them to remain on its territory, at its embassies, on its vessels, or in a similar location because they cannot return to their home country. This may be because of persecution or a fear of persecution due to ethnicity, religion, nationality, affiliations, etc. ", 
    "ResistanceRebellionOrUprising": "ResistanceRebellionOrUprising defines organized opposition to a government/GeopoliticalEntity or some authority. It may involve the taking of control from the authority. ResistanceRebellionOrUprising may or may not be violent.", 
    "RespectForRightsFreedoms": "Fundamental rights include the right to self-determination, liberty, due process and peaceful assembly/freedom of association, as well as freedom of thought, religion, movement and expression. This class deals with events/conditions that permit, encourage or strengthen individual freedoms by the government, military, law enforcement or social groups. It includes passing laws, prosecuting abuses, and actively supporting rights and freedoms. RespectForRightsFreedoms may describe either a specific event, or a general environment of respect.", 
    "Restoration": "Restoration deals with the return of something to a previous owner, to a previous location or to a previous condition.", 
    "Retreat": "Retreat mostly describes military acts of withdrawing/moving troops to a different location to escape an enemy's forces or after a defeat, or to initial signal given to begin a retreat. However, the class can also be used to characterize any act of removing oneself or another Actor to escape something dangerous or unpleasant, or to be alone/to mediate/to study/...", 
    "RetreatSurrenderOrYielding": "This class is used when the exact nature or reason for cessation of fighting is unknown.", 
    "ReturnOrRelease": "ReturnOrRelease deals with any action to restore something to its original owner or location, to grant freedom to someone or something or to let fall/spill/drop from something.", 
    "Riot": "A Riot is an act of violence by an unruly mob or a state of disorder involving group violence.", 
    "Risk": "A source of danger with the possibility of incurring damage/injury, loss or misfortune.", 
    "RoadBlocked": "A road rendered impassable due to obstructions.", 
    "RoadsideBombing": "When an explosive device was placed in or alongside of a road and detonated when a target approached.", 
    "RuralDevelopment": "RuralDevelopment programs and activities have the goal of improving the quality of life, economic well-being, and social and economic development of rural communities, which are often isolated and have low population densities.", 
    "Sadness": "Sadness is  where an Actor is sorrowful or unhappy in general, or regarding a situation.", 
    "Sanctions": "Deals with the restriction of movement (i.e., a sanction) of items or people.", 
    "SanitaryConditions": "SanitaryConditions indicates that an environment/location is safe and free from elements that 'may transmit, generate or promote disease, injury or sickness to any person'.", 
    "SearchAndRescue": "SearchAndRescue deals with the use of aircraft, surface craft, submarines, and specialized rescue teams and equipment to search for and rescue distressed persons on land or at sea in a permissive environment.",
    "SeekingPoliticalIndependence": "An event where by a group seeks self determination away from another geopolitical entity.", 
    "Sentiment": "Sentiment or opinion an Actor has about another Actor an Event.", 
    "SeparationOrDivorce": "The legal dissolution/ending of a marriage, cohabitation or formal relationship. This may occur due to mutual agreement or be ordered by some authority.", 
    "SettlementOfDisagreementOrDispute": "The ending/resolution of a disagreement or dispute.", 
    "SexualAssault": "A type of PhysicalAssault 'in which a person intentionally sexually touches another person without that person's consent, or coerces or physically forces a person to engage in a sexual act against their will. It is a form of sexual violence which includes rape ..., groping, child sexual abuse or the torture of the person in a sexual manner.'", 
    "Shame": "Shame is where an Actor feels humiliation or distress over some behavior or situation.", 
    "SharingOfInformation": "SharingOfInformation may describe either a specific event where two actors share information/intelligence to achieve a goal, or a general environment of sharing.", 
    "Shortage": "There can be shortages of things/artifacts (such as a shortage of food, water or schools), shortages of services/people in certain roles (such as a shortage of police or teachers), or shortages related to different Factors (such as a shortage of goodwill).", 
    "ShowOrExhibit": "Examples of ShowOrExhibit are the screening of a movie or an art exhibit. If the event is related to the arts or an exhibit at a museum, etc., the ArtsAndCulture class should also be used.", 
    "SocialCondition": "SocialCondition involves any 'existing circumstance, situation or state affecting the life, welfare and relations of human beings in [a location or] community'.", 
    "SolarFlare": "SolarFlares are a release of radiation from the sun caused by the interaction of magnetic field lines near sunspots. They can disrupt the upper atmosphere and signal transmissions, or induce electric fluctuations blowing out transformers and affecting electronics.", 
    "SponsorOrHost": "SponsorOrHost involves any act of assuming responsibility for, or providing leadership, resources and/or facilities for a function or event.", 
    "Stasis": "Stasis is used to record no difference/change in the availability/amount of a thing/artifact (such as no change in the amount of food, water or schooling), no difference/change in the number of people in certain roles (such as no change in the number of police or teachers), or no change related to 'general' Events (such as no change in the number of MurderOrHomicide occurrences in a specific location) or Factors (such as no change in the Anger level in a community).", 
    "StateOfEmergencyOrMartialLaw": "A StateOfEmergencyOrMartialLaw is a 'situation in which a government is empowered to perform actions that it would normally not be permitted to do. A government can declare such a state during a disaster, civil unrest, or armed conflict. Such declarations alert citizens to change their normal behavior and orders government agencies to implement emergency plans.'  Martial law is a more severe form of emergency with military control of the functioning of a community/region.", 
    "Stoning": "Stoning is the act of throwing stones as a form of punishment. It may lead to death.", 
    "Storm": "A Storm can providing details related to a specific event, changes in the frequency of storms (Increase/Decrease/Stasis) or statistics on the temperatures, winds and/or amount of lightening strikes or rain related to a single storm or over a period of time.", 
    "Strike": "Strikes are a group's refusal to work in protest against conditions, wages or other grievances.", 
    "StrongOrIntense": "An additional classification on an Event/Factor to indicate that the occurrence or Factor was more intense/above conventional standards.", 
    "StructuralDamage": "The type, StructuralDamage, describes an on-going condition in the environment where structrual damage has occured.", 
    "Subversion": "Subversion covers a broad range of activities that are intended to decrease or destroying someone's (or some group's) honesty or loyalty, to undermine their moral integrity, or to overthrow or destroy a government.", 
    "Suicide": "Suicide is the act of taking one's own life. Not all suicides result in death. Hence, this class is about the act of suicide and not its result.", 
    "SuicideBombing": "Any bombing event in which the attacker intends to kill themselves in order to cause harm to or damage/destroy a target.", 
    "Support": "Support deals strictly with arguing in defense/support of a topic or Actor.", 
    "SurrenderOrYielding": "SurrenderOrYielding is a FormalAgreement in which one Actor admits defeat and/or agrees to give up fighting or to relinquish power, possession or control of something to another.", 
    "SymbolicAct": "An act imbued with deeper meaning or significance that represents a principle or abstract idea.", 
    "SystemicDiscrimination": "Specific acts or general conditions/patterns of behavior/policies/practices that 'create or perpetuate disadvantage for ... persons'", 
    "SystemicExploitation": "Specific acts or general conditions/patterns of behavior/policies/practices that treat a person or populace unfairly, or use/manipulate them to another's advantage.", 
    "TariffOrTradeSanctions": "TariffOrTradeSanctions place a tax or restriction on import/exports in order to express disapproval or displeasure, or give advantage to a local industry/set of workers.", 
    "TensionOrStress": "TensionOrStress is an EmotionalResponse where an Actor is experiencing strain.", 
    "TerminationOrEnd": "An additional classification on an Event to indicate that an ongoing Event/Factor ended.", 
    "Terrorism": "Activities related to 'the unlawful use of violence or threat of violence, often motivated by religious, political, or other ideological beliefs, to instill fear and coerce governments or societies in pursuit of goals that are usually political'.", 
    "Testifying": "Testifying is a DeclarativeCommunication related to providing evidence about something or someone. This is mainly used in legal/court settings.", 
    "Thanking": "Thanking is a Communication conveying gratitude or appreciation for some act.", 
    "TheftOfAid": "TheftOfAid is any type of taking/stealing of aid-related resources. The resouce(s) that are stolen can be moneties or goods.", 
    "TheftOrRobbery": "TheftOrRobbery is any type of taking/stealing of something unlawfully. The thing(s) that are taken can be moneties, goods or even Persons.", 
    "Threatening": "Threatening is any Communication that menaces or frightens another by expressing the intent to take action in retribution for something done or not done.", 
    "ThreateningNonForce": "ThreateningNonForce is any Communication that menaces or frightens another by expressing the intent to take action in retribution for something done or not done. The action that is threatened is not violent or physical.", 
    "Tornado": "A sub-class of Storm, HighWind and NaturalDisaster providing details related to a specific event, changes in the frequency of tornadoes (Increase/Decrease/Stasis) or statistics related to a single tornado or over a period of time.", 
    "Torture": "Torture is any act deliberately intended to inflict physical or mental suffering in order to force another Person to provide information, to make a confession or for other reasons.", 
    "Tourism": "Activities and conditions that promote/prohibit travel for business or pleasure, by peoples within and external to a Geopolitical Entity.", 
    "Transaction": "Deals with any type of agreement or deal that involves exchanging/transferring monies, leadership, ownership, or all of the above. The transfer may be amicable or forced, seamless or not.", 
    "TransferOfFunds": "A TransferOfFunds is not a Purchasing Event, but reflects a movement of funds by the active actor. For example, if a person moves monies from one account to another, that is a TransferOfFunds.", 
    "TransferOfLeadership": "TransferOfLeadership is any change/turnover of the head of a government, organization, etc. The transfer may be amicable or forced, seamless or not.", 
    "TransferOfLeadershipOrPolicyChange": "TransferOfLeadershipOrPolicyChange is any change/turnover of the head of a government, organization, etc. or change in policy", 
    "TransferOfOwnership": "TransferOfOwnership is any ownership change. The transfer may be amicable or forced, seamless or not.", 
    "Transparency": "Transparency is clarity, lack of obfuscation, accountability and openness regarding activities and conditions. Note that the class may be used to describe a specific Event (such as a divulging the source of funding for a project).", 
    "TrespassOrIncursion": "Deals with any type of entry into an area or property without right or permission.", 
    "TropicalStorm": "A TropicalStorm is 'a rapidly rotating storm system characterized by a low-pressure center, a closed low-level atmospheric circulation, strong winds, and a spiral arrangement of thunderstorms that produce heavy rain'", 
    "Ultimatum": "Ultimatum is 'a demand whose fulfillment is requested in a specified period of time and which is backed up by a threat ... in case of noncompliance ... An ultimatum is generally the final demand in a series of requests. As such, the time allotted is usually short, and the request is understood not to be open to further negotiation. The threat which backs up the ultimatum can vary depending on the demand in question and on ... other circumstances.  The word is used in diplomacy to signify the final terms submitted by one of the parties in negotiation for settlement of any subject of disagreement. It is accompanied by an intimation as to how refusal will be regarded.'", 
    "UnintentionalAct": "An additional classification on an Event to indicate that an Actor did not intention to cause the Event.", 
    "UnsanitaryConditions": "UnsanitaryConditions indicate that an environment/location is not safe and contains elements that 'may transmit, generate or promote disease, injury or sickness to any person'. ... Unsanitary conditions can include insect or rodent infestations, large amounts of animal or human waste, clutter throughout the living area, no operational utilities (heat, electricity or hot water) and/or extreme uncleanliness.'", 
    "UnstableStructure": "A structure may be 'unstable' due to damage, in which case, the StructuralDamage type should also be used for an individual, or may be unstable due to its design.", 
    "Veto": "Veto is a DeclarativeCommunication that blocks, refuses to approve/endorse or rejects a decision, proposal or future action.", 
    "ViolationOfAgreement": "ViolationOfAgreement is any act that disregards or goes against a previous agreement or any of its conditions.", 
    "ViolationOfCeasefire": "ViolationOfCeasefireOrTruce is any act that disregards or goes against a previous CeasefireOrTruce agreement or any of its conditions.", 
    "ViolationOfTruce": "ViolationOfCeasefireOrTruce is any act that disregards or goes against a previous CeasefireOrTruce agreement or any of its conditions.", 
    "Violence": "Any act of aggression an act of aggression that could result in injury and/or destruction.", 
    "Visit": "A Visit is the act of going to see a place or meeting with some person for a short time (in either a professional capacity or for personal reasons). The meeting usually has a specific purpose such as entertainment or sightseeing, to make a request, or to accomplish something.", 
    "Volunteering": "Volunteering is the performance of (or commitment to perform) work or rendering of a service without pay.", 
    "Voting": "Voting is meant to address both voting for/against a candidate or on an issue. This is distinct from an Election, which is the process of choosing someone for a position (which may be a political office, but is not necessarily so - e.g., 'John was elected to be the jury foreman')", 
    "War": "A War is where the involved Actors have officially declared a state-of-war/hostility towards each other.", 
    "WarCrime": "A WarCrime is 'an act that constitutes a serious violation of the laws of war that gives rise to individual criminal responsibility. Examples of war crimes include intentionally killing civilians or prisoners, torturing, destroying civilian property, taking hostages, performing a perfidy, raping, using child soldiers, pillaging, declaring that no quarter will be given, and seriously violating the principles of distinction and proportionality, such as strategic bombing of civilian populations.'", 
    "WaterInsecurity": "Water insecurity is defined as the insufficient availability of, or insufficient access to, clean water to meet the needs of the population for consumption, sanitation, healthcare and the production of food and goods.", 
    "WaterSecurity": "Water security is defined as a sufficient availability of, and access to, clean water to meet the needs of the population for consumption, sanitation, healthcare and the production of food and goods.", 
    "WeakOrLimited": "An additional classification on an Event/Factor to indicate that it was limited/relatively minor/below conventional standards.", 
    "WeatherIssue": "Any environmental condition related to atmospheric conditions in an area. Weather includes temperature, wind, clouds/precipitation, etc. and their effects. Either specific events may be defined, or general conditions/statistics.", 
    "Wedding": "The legal binding of two Actors in marriage, which is also usually a social event/ceremony.", 
    "Withdrawal": "Withdrawal is a movement out/retraction of a previously held position or ceasing to participate in an activity." 
}